OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates_LL/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/PY32F072_HAL_Driver/Inc/py32f072_hal_can.h
  uint32_t ErrorPassive;      /*!< Specifies the CAN module error status.
                                   This parameter can be:
                                    - 0 : The CAN is in Error_Active state
                                    - 1 : The CAN is in Error_Passive state                                                */

  uint32_t Warning;           /*!< Specifies the CAN module warning status.
                                   This parameter can be:
                                    - 0 : error counters (RxErrorCnt and TxErrorCnt) are below the Error_Warning limit
                                    - 1 : at least one of error counters has reached the Error_Warning limit          */

  uint32_t BusOff;            /*!< Specifies the CAN module Bus_Off status.
                                   This parameter can be:
                                    - 0 : The CAN is not in Bus_Off state
                                    - 1 : The CAN is in Bus_Off state                                                      */

} CAN_ProtocolStatusTypeDef;

/**
  * @brief CAN transmit status Structure definition
  */
typedef struct
{
  uint32_t LastTxHandle;     /*!< Specifies the handle value of the last Tx frame.
                                  This parameter can be a number between 0 and 255                                           */
  
  uint32_t LastTxStatus;     /*!< Specifies the status of the last Tx frame.
                                  This parameter can be a value of @ref CAN_transmit_status                                */
  
  uint32_t TxHandle;         /*!< Specifies the handle value of the current Tx frame.
                                  This parameter can be a number between 0 and 255                                           */

  uint32_t TxStatus;         /*!< Specifies the status of the current Tx frame.
                                  This parameter can be a value of @ref CAN_transmit_status                                */
  
} CAN_TxStatusTypeDef;


#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
typedef struct __CAN_HandleTypeDef
#else
typedef struct
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
{
  CAN_TypeDef                 *Instance;                 /*!< Register base address */

  CAN_InitTypeDef             Init;                      /*!< CAN required parameters */

  __IO HAL_CAN_StateTypeDef   State;                     /*!< CAN communication state */

  HAL_LockTypeDef               Lock;                      /*!< CAN locking object      */

  __IO uint32_t                 ErrorCode;                 /*!< CAN Error code. */

  uint32_t                      LastTimeTrigType;          /*!< CAN last time trig type */

  uint32_t                      LastAbortTxType;           /*!< CAN last abort transmit type */

  uint32_t                      LastSTBTxType;             /*!< CAN last STB transmit type */

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
  void (* RxCpltCallback)(__CAN_HandleTypeDef *hcan);
  void (* RxFifoAlmostFullCallback)(__CAN_HandleTypeDef *hcan);
  void (* RxFifoFullCallback)(__CAN_HandleTypeDef *hcan);
  void (* PtbTxCpltCallback)(__CAN_HandleTypeDef *hcan);
  void (* StbTxCpltCallback)(__CAN_HandleTypeDef *hcan, uint32_t LastSTBTxType);
  void (* RxFifoOverflowCallback)(__CAN_HandleTypeDef *hcan);
  void (* ArbitrationLostCallback)(__CAN_HandleTypeDef *hcan);
  void (* TxAbortCallback)(__CAN_HandleTypeDef *hcan, uint32_t LastAbortTxType);
  void (* PassiveErrorCallback)(__CAN_HandleTypeDef *hcan);
  void (* BusErrorCallback)(__CAN_HandleTypeDef *hcan);
  void (* ErrorChangeCallback)(__CAN_HandleTypeDef *hcan);
  void (* TT_RxTimeTrigCallback)(__CAN_HandleTypeDef *hcan);
  void (* TT_TxSingleTrigCallback)(__CAN_HandleTypeDef *hcan);
  void (* TT_TxStartTrigCallback)(__CAN_HandleTypeDef *hcan);
  void (* TT_TxStopTrigCallback)(__CAN_HandleTypeDef *hcan);
  void (* TT_TimestampWraparoundCallback)(__CAN_HandleTypeDef *hcan);
  void (* TT_TrigErrorCallback)(__CAN_HandleTypeDef *hcan);  
  
  void (* MspInitCallback)(struct __CAN_HandleTypeDef *hfdcan);                     /*!< CAN Msp Init callback              */
  void (* MspDeInitCallback)(struct __CAN_HandleTypeDef *hfdcan);                   /*!< CAN Msp DeInit callback            */
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */

} CAN_HandleTypeDef;

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
/**
  * @brief  HAL CAN common Callback ID enumeration definition
  */
typedef enum
{
  HAL_CAN_RX_COMPLETE_CB_ID             = 0x00U,    /*!< CAN Rx complete callback ID                */
  HAL_CAN_RX_FIFO_ALMOST_FULL_CB_ID     = 0x01U,    /*!< CAN Rx fifo almost full callback ID        */
  HAL_CAN_RX_FIFO_FULL_CB_ID            = 0x02U,    /*!< CAN Rx fifo full callback ID               */
  HAL_CAN_PTB_TX_COMPLETE_CB_ID         = 0x03U,    /*!< CAN PTB Tx complete callback ID            */
  HAL_CAN_STB_TX_COMPLETE_CB_ID         = 0x04U,    /*!< CAN STB Tx complete callback ID            */
  HAL_CAN_TX_ABORT_CB_ID                = 0x05U,    /*!< CAN Tx abort callback ID                   */
  HAL_CAN_RX_FIFO_OVERFLOW_CB_ID        = 0x06U,    /*!< CAN Rx fifo overflow callback ID           */
  HAL_CAN_ARBITRATION_LOST_CB_ID        = 0x07U,    /*!< CAN Arbitration lost callback ID           */

  HAL_CAN_PASSIVE_ERROR_CB_ID           = 0x08U,    /*!< CAN Passive error callback ID              */
  HAL_CAN_BUS_ERROR_CB_ID               = 0x09U,    /*!< CAN Bus error callback ID                  */
  HAL_CAN_ERROR_CHANGE_CB_ID            = 0x0AU,    /*!< CAN Error change callback ID               */

  HAL_CAN_TT_RX_TIME_TRIG_CB_ID         = 0x0BU,    /*!< CAN TT Rx time trig callback ID            */
  HAL_CAN_TT_TX_SINGLE_TRIG_CB_ID       = 0x0CU,    /*!< CAN TT Tx single trig callback ID          */
  HAL_CAN_TT_TX_START_TRIG_CB_ID        = 0x0DU,    /*!< CAN TT Tx start trig callback ID           */
  HAL_CAN_TT_TX_STOP_TRIG_CB_ID         = 0x0EU,    /*!< CAN TT Tx stop trig callback ID            */
  HAL_CAN_TT_TIMESTAMP_WRAPAROUND_CB_ID = 0x0FU,    /*!< CAN TT timestamp wraparound callback ID    */

