OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates_LL/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/PY32F072_HAL_Driver/Inc/py32f072_hal_can.h
  HAL_CAN_TT_TRIG_ERROR_CB_ID           = 0x10U,    /*!< CAN TT trig error callback ID              */

  HAL_CAN_MSPINIT_CB_ID                 = 0x11U,    /*!< CAN MspInit callback ID                    */
  HAL_CAN_MSPDEINIT_CB_ID               = 0x12U,    /*!< CAN MspDeInit callback ID                  */

} HAL_CAN_CallbackIDTypeDef;

/**
  * @brief  HAL CAN Callback pointer definition
  */
typedef  void (*pCAN_CallbackTypeDef)(CAN_HandleTypeDef *hcan);     /*!< pointer to a common CAN callback function */

#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup CAN_Exported_Constants CAN Exported Constants
  * @{
  */

/** @defgroup HAL_CAN_Error_Code HAL CAN Error Code
  * @{
  */
#define HAL_CAN_ERROR_NONE            ((uint32_t)0x00000000U) /*!< No error                                                               */
#define HAL_CAN_ERROR_TIMEOUT         ((uint32_t)0x00000001U) /*!< Timeout error                                                          */
#define HAL_CAN_ERROR_NOT_INITIALIZED ((uint32_t)0x00000002U) /*!< Peripheral not initialized                                             */
#define HAL_CAN_ERROR_NOT_READY       ((uint32_t)0x00000004U) /*!< Peripheral not ready                                                   */
#define HAL_CAN_ERROR_NOT_STARTED     ((uint32_t)0x00000008U) /*!< Peripheral not started                                                 */
#define HAL_CAN_ERROR_NOT_SUPPORTED   ((uint32_t)0x00000010U) /*!< Mode not supported                                                     */
#define HAL_CAN_ERROR_PARAM           ((uint32_t)0x00000020U) /*!< Parameter error                                                        */
#define HAL_CAN_ERROR_PENDING         ((uint32_t)0x00000040U) /*!< Pending operation                                                      */
#define HAL_CAN_ERROR_RAM_ACCESS      ((uint32_t)0x00000080U) /*!< Message RAM Access Failure                                             */
#define HAL_CAN_ERROR_FIFO_EMPTY      ((uint32_t)0x00000100U) /*!< Get element from empty FIFO                                            */
#define HAL_CAN_ERROR_FIFO_FULL       ((uint32_t)0x00000200U) /*!< Put element in full FIFO                                               */

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
#define HAL_CAN_ERROR_INVALID_CALLBACK ((uint32_t)0x00000400U) /*!< Invalid Callback error                                                */
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
/**
  * @}
  */
  
/** @defgroup CAN_frame_format CAN Frame Format
  * @{
  */
#define CAN_FRAME_CLASSIC   ((uint32_t)0x00000000U)                     /*!< Classic mode                      */
/**
  * @}
  */

/** @defgroup CAN_data_length_code CAN Data Length Code
  * @{
  */
#define CAN_DLC_BYTES_0              ((uint32_t)0x00000000U) /*!< 0 bytes data field  */
#define CAN_DLC_BYTES_1              ((uint32_t)0x00000001U) /*!< 1 bytes data field  */
#define CAN_DLC_BYTES_2              ((uint32_t)0x00000002U) /*!< 2 bytes data field  */
#define CAN_DLC_BYTES_3              ((uint32_t)0x00000003U) /*!< 3 bytes data field  */
#define CAN_DLC_BYTES_4              ((uint32_t)0x00000004U) /*!< 4 bytes data field  */
#define CAN_DLC_BYTES_5              ((uint32_t)0x00000005U) /*!< 5 bytes data field  */
#define CAN_DLC_BYTES_6              ((uint32_t)0x00000006U) /*!< 6 bytes data field  */
#define CAN_DLC_BYTES_7              ((uint32_t)0x00000007U) /*!< 7 bytes data field  */
#define CAN_DLC_BYTES_8              ((uint32_t)0x00000008U) /*!< 8 bytes data field  */
/**
  * @}
  */

/** @defgroup CAN_LLC_FORMAT_BITS CAN LLC format bits
  * @{
  */
#define CAN_LLC_FORMAT_DLC_0         ((uint32_t)0x00000001U)         /*!< BIT DLC_0  */
#define CAN_LLC_FORMAT_DLC_1         ((uint32_t)0x00000002U)         /*!< BIT DLC_1  */
#define CAN_LLC_FORMAT_DLC_2         ((uint32_t)0x00000004U)         /*!< BIT DLC_2  */
#define CAN_LLC_FORMAT_DLC_3         ((uint32_t)0x00000008U)         /*!< BIT DLC_3  */
#define CAN_LLC_FORMAT_IDE           ((uint32_t)0x00010000U)         /*!< BIT IDE    */
#define CAN_LLC_FORMAT_FDF           ((uint32_t)0x00020000U)         /*!< BIT FDF    */
#define CAN_LLC_FORMAT_RMF           ((uint32_t)0x00100000U)         /*!< BIT RMF    */
#define CAN_LLC_FORMAT_KOER_0        ((uint32_t)0x01000000U)         /*!< BIT KOER_0 */
#define CAN_LLC_FORMAT_KOER_1        ((uint32_t)0x02000000U)         /*!< BIT KOER_1 */
#define CAN_LLC_FORMAT_KOER_2        ((uint32_t)0x04000000U)         /*!< BIT KOER_2 */
#define CAN_LLC_FORMAT_LBF           ((uint32_t)0x10000000U)         /*!< BIT LBF    */

#define CAN_LLC_FORMAT_DLC           ((uint32_t)0x0000000FU)         /*!< BIT DLC    */
#define CAN_LLC_FORMAT_KOER          ((uint32_t)0x07000000U)         /*!< BIT KOER   */

#define CAN_LLC_FORMAT_KOER_Pos      (24)                            /*!< BIT KOER Pos   */
/**
  * @}
  */

/** @defgroup CAN_id_type CAN id type
  * @{
  */
#define CAN_STANDARD_ID            ((uint32_t)0x00000000U)         /*!< Standard ID element */
#define CAN_EXTENDED_ID            ((uint32_t)0x00010000U)         /*!< Extended ID element */
/**
  * @}
  */

/** @defgroup CAN_format CAN Frame Format
  * @{
  */
#define CAN_CLASSIC_CAN            ((uint32_t)0x00000000U)         /*!< Classic frame      */
/**
  * @}
  */

/** @defgroup CAN_frame_type CAN frame type
  * @{
  */
#define CAN_DATA_FRAME                   ((uint32_t)0x00000000U)         /*!< data frame        */
#define CAN_REMOTE_FRAME                 ((uint32_t)0x00100000U)         /*!< remote frame      */
/**
  * @}
  */

/** @defgroup CAN_protocol_error_type CAN frame error type
  * @{
  */
#define CAN_PROTOCOL_NONE_ERROR             ((uint32_t)0x00000000U)         /*!< no error                     */
#define CAN_PROTOCOL_BIT_ERROR              ((uint32_t)0x00000001U)         /*!< frame bit error              */
#define CAN_PROTOCOL_FORM_ERROR             ((uint32_t)0x00000002U)         /*!< frame form error             */
#define CAN_PROTOCOL_STUFF_ERROR            ((uint32_t)0x00000003U)         /*!< frame bit sruff error        */
#define CAN_PROTOCOL_ACK_ERROR              ((uint32_t)0x00000004U)         /*!< frame ack error              */
#define CAN_PROTOCOL_CRC_ERROR              ((uint32_t)0x00000005U)         /*!< all stored data are invalid  */
#define CAN_PROTOCOL_OTHER_ERROR            ((uint32_t)0x00000006U)         /*!< OTHER ERROR  */
/**
  * @}
  */

/** @defgroup CAN_loopback_frame CAN loop back frame
  * @{
  */
#define CAN_LOOPBACK_FRAME_ON         ((uint32_t)0x00000000U)         /*!< CAN receive frame is LoopBack frame     */
#define CAN_LOOPBACK_FRAME_OFF        ((uint32_t)0x10000000U)         /*!< CAN receive frame is not LoopBack frame */
/**
  * @}
  */

/** @defgroup CAN_operating_mode CAN Operating Mode
  * @{
*/
#define CAN_MODE_NORMAL                (0x00000000U)                                  /*!< Normal mode   */
#define CAN_MODE_RESTRICTED_OPERATION  ((uint32_t)CAN_TSNCR_ROP)                    /*!< Restricted operation mode */
#define CAN_MODE_LOOPBACK_EXT_NOACK    ((uint32_t)CAN_MCR_LBME)                     /*!< Loopback mode */
#define CAN_MODE_LOOPBACK_EXT_ACK      ((uint32_t)(CAN_MCR_LBME | CAN_MCR_SACK))  /*!< Loopback mode */
#define CAN_MODE_LOOPBACK_INT          ((uint32_t)CAN_MCR_LBMI)                     /*!< Loopback mode */
#define CAN_MODE_SILENT                ((uint32_t)CAN_MCR_LOM)                      /*!< Silent mode   */
#define CAN_MODE_SILENT_LOOPBACK       ((uint32_t)(CAN_MCR_LOM | CAN_MCR_LBME))   /*!< Loopback combined with silent mode */
/**
  * @}
  */

/** @defgroup CAN_retransmission_Limit CAN Retransmission Limit
  * @{
*/
#define CAN_AUTO_RETRANSMISSION_1TRANSFER           (0x00000000U)
#define CAN_AUTO_RETRANSMISSION_2TRANSFERS          ((uint32_t)CAN_RLSSP_RETLIM_0)
#define CAN_AUTO_RETRANSMISSION_3TRANSFERS          ((uint32_t)CAN_RLSSP_RETLIM_1)
#define CAN_AUTO_RETRANSMISSION_4TRANSFERS          ((uint32_t)(CAN_RLSSP_RETLIM_0|CAN_RLSSP_RETLIM_1))
#define CAN_AUTO_RETRANSMISSION_5TRANSFERS          ((uint32_t)CAN_RLSSP_RETLIM_2)
#define CAN_AUTO_RETRANSMISSION_6TRANSFERS          ((uint32_t)(CAN_RLSSP_RETLIM_0 | CAN_RLSSP_RETLIM_2))
#define CAN_AUTO_RETRANSMISSION_7TRANSFERS          ((uint32_t)(CAN_RLSSP_RETLIM_1 | CAN_RLSSP_RETLIM_2))
#define CAN_AUTO_RETRANSMISSION_NO_LIMIT            ((uint32_t)(CAN_RLSSP_RETLIM_0 | CAN_RLSSP_RETLIM_1 | CAN_RLSSP_RETLIM_2))
/**
  * @}
  */

/** @defgroup CAN_rearbitration_Limit CAN Rearbitration Limit
  * @{
  */
#define CAN_AUTO_REARBITRATION_1TRANSFER           (0x00000000U)
#define CAN_AUTO_REARBITRATION_2TRANSFERS          ((uint32_t)CAN_RLSSP_REALIM_0)
#define CAN_AUTO_REARBITRATION_3TRANSFERS          ((uint32_t)CAN_RLSSP_REALIM_1)
#define CAN_AUTO_REARBITRATION_4TRANSFERS          ((uint32_t)(CAN_RLSSP_REALIM_0|CAN_RLSSP_REALIM_1))
#define CAN_AUTO_REARBITRATION_5TRANSFERS          ((uint32_t)CAN_RLSSP_REALIM_2)
#define CAN_AUTO_REARBITRATION_6TRANSFERS          ((uint32_t)(CAN_RLSSP_REALIM_0 | CAN_RLSSP_REALIM_2))
#define CAN_AUTO_REARBITRATION_7TRANSFERS          ((uint32_t)(CAN_RLSSP_REALIM_1 | CAN_RLSSP_REALIM_2))
#define CAN_AUTO_REARBITRATION_NO_LIMIT            ((uint32_t)(CAN_RLSSP_REALIM_0 | CAN_RLSSP_REALIM_1 | CAN_RLSSP_REALIM_2))
/**
  * @}
  */
  
/** @defgroup CAN_RX_FIFO_threshold CAN receive fifo almost full warning limit.
  * @{
  */
#define CAN_RX_FIFO_THRESHOLD_1SLOT          ((uint32_t)CAN_WECR_AFWL_0)
#define CAN_RX_FIFO_THRESHOLD_2SLOTS         ((uint32_t)CAN_WECR_AFWL_1)
#define CAN_RX_FIFO_THRESHOLD_3SLOTS         ((uint32_t)(CAN_WECR_AFWL_0 | CAN_WECR_AFWL_1))
/**
  * @}
  */

/** @defgroup CAN_transmit_mode CAN transmit Mode
  * @{
  */
#define CAN_TXFIFO_PTB_SEND            (0x00000001U)
#define CAN_TXFIFO_STB_SEND_ONE        (0x00000002U)
#define CAN_TXFIFO_STB_SEND_ALL        (0x00000004U)
/**
  * @}
  */

